---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalMember.StructuralSectionShape
source: html/74d01c4a-9032-e740-2338-e9a8ec6711d5.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalMember.StructuralSectionShape Property

The structural section shape of the Analytical Member.

## Syntax (C#)
```csharp
public StructuralSectionShape StructuralSectionShape { get; }
```